/*
 * 회원의 전화번호와 주소를 등록, 검색할 수 있는 프로그램을 작성하시오.
 * 
 * - 다음과 같은 Person 클래스를 정의하여 회원 1명의 정보를 담을 수 있게 한다.
 * 	회원주소록 프로그램에서 한명의 회원정보를 나타내는 클래스.
 * 	회원번호, 이름, 전화번호, 주소 이렇게 3가지의 속성을 가진다.
 * 	모든 필드는 접근 지정자가 private이며,
 * 	각 필드의 값을 변경하는 Setter와 각 필드의 값을 읽어서 리턴하는 Getter를 가진다.
 * 	기본생성자와 모든 필드값을 전달받아 초기화하는 생성자를 가진다.
 * 	각 필드의 값을 다음과 같이 출력하는 print()메소드를 정의한다.
 * 
 * - 메뉴를 출력하고 메뉴 번호를 입력받아 해당 기능을 수행한다.
 * - 0번 메뉴를 선택할 때까지 프로그램은 반복된다.
 * - 회원정보는 원소 10개짜리  Person배열을 생성하여 저장한다.
 * - 10명이 등록되면 1번 메뉴를 선택했을 때, 더이상 등록할 수 없다는 메시지를 출력한다.
 * - 검색 기능은 회원 이름을 입력받아, 등록된 모든 회원과 비교한 후 찾으면 회원 정보를 출력한다
 * 
 * */
import java.util.Scanner;

public class Queston4 {

	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		

	}

}
